Autodesk.Revit.DB.ExternallyTaggedGeometryValidation.IsNonSolid(Autodesk.Revit.DB.GeometryObject)
Makes sure that the input geometry object is not a Solid.
geometry:
Geometry object to be validated.
Returns:
True if the supplied geometry object is not a Solid.
Since:
2022

Autodesk.Revit.DB.ExternallyTaggedGeometryValidation.IsSolid(Autodesk.Revit.DB.GeometryObject)
Makes sure that the input geometry object is a Solid.
geometry:
Geometry object to be validated.
Returns:
True if the supplied geometry object is a Solid.
Since:
2022